examples/RMD/RemoveDocumentsRequest_SOAP.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap12:Envelope 
	xmlns:soap12="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing">
	<soap12:Header>
		<wsa:Action soap12:mustUnderstand="1">urn:ihe:iti:rmd:2016:RemoveDocuments</wsa:Action>
		<wsa:MessageID>urn:uuid:D6C21225-8E7B-454E-9750-821622C099DB</wsa:MessageID>
		<wsa:To soap12:mustUnderstand="1">http://localhost:2647/XdsService/RemoveDocumentReceiver.svc</wsa:To>
		<wsa:ReplyTo>
			<wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
		</wsa:ReplyTo>
	</soap12:Header>
	<soap12:Body>
		<rmd:RemoveDocumentSetRequest 
			xmlns:rmd="urn:ihe:iti:rmd:2017" 
			xmlns:xds="urn:ihe:iti:xds-b:2007" 
			xmlns:rs="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0">
			<xds:DocumentRequest>
				<xds:RepositoryUniqueId>1.3.6.1.4.1000</xds:RepositoryUniqueId>
				<xds:DocumentUniqueId>1.3.6.1.4.2300</xds:DocumentUniqueId>
			</xds:DocumentRequest>
			<xds:DocumentRequest>
				<xds:RepositoryUniqueId>1.3.6.1.4.1000</xds:RepositoryUniqueId>
				<xds:DocumentUniqueId>1.3.6.1.4.2301</xds:DocumentUniqueId>
			</xds:DocumentRequest >
		</rmd:RemoveDocumentSetRequest>
	</soap12:Body>
</soap12:Envelope>

